Introduction to SQL Queries

## Writing SQL Queries:
    
SQL syntax is fairly simple to follow, but writing SQL queries can be difficult because of all the logic and relationships you must mentally track. In order to make this a little more simple, we want to break this down into a three step process.  

1. Pose a question.
2. Determine what data is needed to answer the question, identify the table(s) where that data exists, and understand the relationship between the tables. 
3. Map all of this to SQL syntax.

## Syntax rules:

`SELECT lastName,firstName FROM Member WHERE state=”CA” AND
city=”Fresno” ORDER BY lastName`
    
- **Capitalization**: The case of the SQL words doesn’t matter; for example, select is the same as SELECT, and from is the same as FROM, as far as MySQL is concerned. On the other hand, the case of the table names, column names, and other variable information does matter if your operating system is Unix or Linux. When you’re using Unix or Linux, MySQL needs to match the column names exactly, so the case for the column names has to be correct — for example, lastname isn’t the same as lastName. Windows, however, isn’t as picky as Unix and Linux; from its point of view, lastname and lastNameare the same.
- **Spacing**: SQL words must be separated by one or more spaces. It doesn’t matter how many spaces you use; you could just as well use 20 spaces or just 1 space. SQL also doesn’t pay any attention to the end of the line. You can start a new line at any point in the SQL statement or write the entire statement on one line.
- **Quotes**: Notice that CA and Fresno are enclosed in double quotes (“) in the preceding query. CA and Fresno are a series of characters called text strings or character strings. You’re asking MySQL to compare the text strings in the SQL query with the text strings already stored in the database. When you compare numbers (such as integers) stored in numeric columns, you don’t enclose the numbers in quotes.

## SQL Commands: Data Definition Language Commands (DDL)
This section will discuss the commands through which you can define your database. The commands are as follows:

- CREATE
- DROP
- TRUNCATE
- ALTER
- BACKUP DATABASE

### CREATE

This statement is used to create a table or a database.

#### The ‘CREATE DATABASE’ Statement:
As the name suggests, this statement is used to create a database.

**Syntax**

`CREATE DATABASE DatabaseName;`

**Example**

`CREATE DATABASE Employee;`

#### The **‘CREATE TABLE’** Statement

This statement is used to create a table.

**Syntax**
`CREATE TABLE TableName (
Column1 datatype,
Column2 datatype,
Column3 datatype,
....

ColumnN datatype
);`

**Example**

`CREATE TABLE Employee_Info
(
EmployeeID int,
EmployeeName varchar(255),
Emergency ContactName varchar(255),
PhoneNumber int,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`

You can also create a table using another table. Refer the below sytax and example:

#### The ‘CREATE TABLE AS’ Statement
**Syntax**

`CREATE TABLE NewTableName AS
SELECT Column1, column2,..., ColumnN
FROM ExistingTableName
WHERE ....;`

**Example**

`CREATE TABLE ExampleTable AS
SELECT EmployeeName, PhoneNumber
FROM Employee_Info;`

### DROP
This statement is used to drop an existing table or a database.

#### The ‘DROP DATABASE’ Statement
This statement is used to drop an existing database. When you use this statement, complete information present in the database will be lost.

**Syntax**

`DROP DATABASE DatabaseName;`

**Example**

`DROP DATABASE Employee;`

#### The ‘DROP TABLE’ Statement
This statement is used to drop an existing table. When you use this statement, complete information present in the table will be lost.

**Syntax**

`DROP TABLE TableName;`

**Example**

`DROP Table Employee_Info;`

### TRUNCATE
This command is used to delete the information present in the table but does not delete the table. So, once you use this command, your information will be lost, but not the table.

**Syntax**

`TRUNCATE TABLE TableName;`

**Example**

`TRUNCATE Table Employee_Info;`

### The ‘ALTER TABLE’ Statement
This statement is used to add, delete, modify columns in an existing table.

#### The ‘ALTER TABLE’ Statement with ADD/DROP COLUMN
You can use the ALTER TABLE statement with ADD/DROP Column command according to your need. If you wish to add a column, then you will use the ADD command, and if you wish to delete a column, then you will use the DROP COLUMN command.

**Syntax**
`ALTER TABLE TableName
ADD ColumnName Datatype;`

`ALTER TABLE TableName
DROP COLUMN ColumnName;`

**Example**

`ALTER TABLE Employee_Info
ADD BloodGroup varchar(255);
 
ALTER TABLE Employee_Info
DROP COLUMN BloodGroup ;`

#### The ‘ALTER TABLE’ Statement with ALTER/MODIFY COLUMN
This statement is used to change the datatype of an existing column in a table.

**Syntax**

`ALTER TABLE TableName
ALTER COLUMN ColumnName Datatype;`

**Example**
 
`ALTER TABLE Employee_Info
ADD DOB year;
 
ALTER TABLE Employee_Info
ALTER DOB date;`

###B ACKUP DATABASE
This statement is used to create a full backup of an existing database.

**Syntax**
`BACKUP DATABASE DatabaseName
TO DISK = 'filepath';`

**Example**

`BACKUP DATABASE Employee
TO DISK = 'C:UsersSahitiDesktop';`

## SQL Commands: Constraints Used In Database
Constraints are used in a database to specify the rules for data in a table. The following are the different types of constraints:

- NOT NULL
- UNIQUE
- CHECK
- DEFAULT
- INDEX


### NOT NULL
This constraint ensures that a column cannot have a NULL value.

**Example**

 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`
 
NOT NULL on ALTER TABLE
 
`ALTER TABLE Employee_Info
MODIFY PhoneNumber int NOT NULL;`

### UNIQUE
This constraint ensures that all the values in a column are unique.

**Example**

UNIQUE on Create Table
 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL UNIQUE,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255)
);`
 
UNIQUE on Multiple Columns
 
`CREATE TABLE Employee_Info
(
EmployeeID int NOT NULL,
EmployeeName varchar(255) NOT NULL,
Emergency ContactName varchar(255),
PhoneNumber int NOT NULL,
Address varchar(255),
City varchar(255),
Country varchar(255),
CONSTRAINT UC_Employee_Info UNIQUE(Employee_ID, PhoneNumber)
);`
 
UNIQUE on ALTER TABLE
 
`ALTER TABLE Employee_Info
ADD UNIQUE (Employee_ID);`
 
To drop a UNIQUE constraint
 
`ALTER TABLE  Employee_Info
DROP CONSTRAINT UC_Employee_Info;`

## Applied: Creating a table

Let's create a db using the `students.json` file as our input data

### Example Query

`create_query = """CREATE TABLE IF NOT EXISTS stuffToPlot
        (unix REAL, datestamp TEXT, keyword TEXT, value REAL)"""`

In [1]:
import sqlite3
import json
f=open('students.json','r')
data=json.load(f)

# query = """
#         CREATE TABLE IF NOT EXISTS students
        
#         """

In [2]:
data

[{'name': 'Amora Sun',
  'DOB': '11/24/1991',
  'siblings': 'none',
  'Birthplace': 'China',
  'yearinnyc': '22',
  'favoritefood': 'Japanese'},
 {'name': 'Alec Ryman',
  'birthdate': '2-14-1993',
  'siblings': 1,
  'Birthplace': 'New York',
  'yearsinnyc': 5,
  'favoritefood': 'sushi'},
 {'name': 'Catherine Wolk',
  'birthdate': None,
  'siblings': 2,
  'Birthplace': 'Danbury, CT',
  'yearsinnyc': 6,
  'Favoritefood': 'Banh Mi'},
 {'name': 'Christopher Park',
  'birthdate': '10-26-91',
  'siblings': 2,
  'Birthplace': 'New York City, New York',
  'yearsinnyc': 10,
  'favoritefood': 'shwarma'},
 {'name': 'Eric Landstein',
  'birthdate': '01-29-91',
  'siblings': 1,
  'Birthplace': 'Long Island, NY',
  'yearsinnyc': 3,
  'favoritefood': 'Pizza'},
 {'name': 'Jaden',
  'birthdate': '08-20-1996',
  'siblings': 1,
  'Birthplace': 'Hong Kong',
  'yearsinnyc': 22,
  'favoritefood': 'Pizza'},
 {'name': 'James Moody',
  'birthdate': '02-11-1991',
  'siblings': 2,
  'Birthplace': 'London, UK',
  'yearsinnyc': 4,
  'favoritefood': 'Vegan Pizza'},
 {'name': 'John Americk Canque',
  'birthdate': 'October 8, 1987',
  'siblings': 'None',
  'Birthplace': 'Manila, Philippines',
  'yearsinnyc': 12,
  'favoritefood': 'Steak Chimichanga'},
 {'name': 'Justin Tennenbaum',
  'birthdate': '02-21-1995',
  'siblings': 2,
  'Birthplace': 'New Brunswick, NJ',
  'yearsinnyc': 24,
  'favoritefood': 'Ribs'},
 {'name': 'Karolina Jozefowicz',
  'birthdate': '05-05-1993',
  'siblings': 1,
  'Birthplace': 'Olsztyn, Poland',
  'yearsinnyc': 0,
  'favoritefood': 'bagels'},
 {'name': 'Kathrin Verestoun',
  'birthdate': '03-14-1988',
  'siblings': 1,
  'Birthplace': 'Odessa, Ukraine',
  'yearsinnyc': 23,
  'favoritefood': 'French Fries'},
 {'name': 'Kevin Sun',
  'birthdate': '11/6/97',
  'siblings': 1,
  'birthplace': 'New Brunswick',
  'yearsinnyc': 0,
  'favoritefood': 'Mac and Cheese'},
 {'name': 'Kyle Baranko',
  'birthdate': '09-22-95',
  'siblings': 2,
  'Birthplace': 'Tucson, AZ',
  'yearsinnyc': 1,
  'favoritefood': 'Pad Thai'},
 {'name': 'mark cleverley',
  'birthdate': 'september 9, 1997',
  'siblings': 0,
  'Birthplace': 'london',
  'yearsinnyc': 4,
  'favoritefood': 'fish sticks'},
 {'name': 'Matt Oliver',
  'birthdate': '04/18/1996',
  'siblings': 1,
  'Birthplace': 'Topsham, Maine',
  'yearsinnyc': 0,
  'favoritefood': 'Reuben Sandwich'},
 {'name': 'Michelle Venables',
  'birthdate': '10/28/1993',
  'siblings': '3',
  'Birthplace': 'New Jersey',
  'yearsinnyc': '2',
  'favoritefood': 'Cucumbers'},
 {'name': 'Paul E. Kruger',
  'birthdate': 'January 4, 1976',
  'siblings': 1,
  'Birthplace': 'Goshen, NY',
  'yearsinnyc': 8,
  'favoritefood': 'steak'},
 {'name': 'Quan Nguyen',
  'birthdate': '3/2/94',
  'siblings': 1,
  'birthplace': 'Vietnam',
  'yearsinnyc': 7,
  'favoritefood': 'pizza'},
 {'name': 'Rebecca',
  'birthdate': 'May 10',
  'siblings': 1,
  'Birthplace': 'Detroit, MI',
  'yearsinnyc': 0.35,
  'favoritefood': 'french toast'},
 {'name': 'Reuben Kavalov',
  'birthdate': '06/25/1995',
  'siblings': 3,
  'Birthplace': 'Queens, NYC',
  'yearsinnyc': 10,
  'favoritefood': 'Chili'},
 {'name': 'Sarah Smith',
  'birthdate': '09/26/1989',
  'siblings': 2,
  'Birthplace': 'Dublin',
  'yearsinnyc': 7,
  'favoritefood': 'pizza'},
 {'name': 'Taylor Appel',
  'birthdate': '03-26-93',
  'siblings': 3,
  'Birthplace': 'Morristown, NJ',
  'yearsinnyc': 0,
  'favoritefood': 'Mac n Cheese'}]

In [5]:
data[0].keys()

dict_keys(['name', 'DOB', 'siblings', 'Birthplace', 'yearinnyc', 'favoritefood'])

In [28]:
query = """
         CREATE TABLE students
         (
             name TEXT NOT NULL UNIQUE,
             dob TEXT,
             siblings NUMERIC,
             birthplace TEXT,
             yearinnyc NUMERIC
             favoritefood TEXT
          )
        
         """

conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

c.execute(query)

In [27]:
query = """
         DROP TABLE students;
         """

conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

c.execute(query)

In [15]:
conn.commit()

In [16]:
# query = """SELECT * FROM students"""
# import pandas as pd
# df = pd.DataFrame(c.execute(query).fetchall())
# df.columns = [x[0] for x in c.description]

## SQL Commands: Data Manipulation Language Commands (DML)
This section commands through which you can manipulate the database. The commands are as follows:

- USE
- INSERT INTO
- UPDATE
- DELETE
- SELECT

Apart from these commands, there are also other manipulative operators/functions such as:

- Operators 
- Aggregate Functions
- NULL Functions
- Aliases & Case Statement

### USE
The USE statement is used to select the database on which you want to perform operations.

**Syntax**

`USE DatabaseName;`

**Example**

`USE Employee;`

### INSERT INTO
This statement is used to insert new records into the table.

**Syntax**
`INSERT INTO TableName (Column1, Column2, Column3, ...,ColumnN)
VALUES (value1, value2, value3, ...);`

--If you don't want to mention the column names then use the below syntax

`INSERT INTO TableName
VALUES (Value1, Value2, Value3, ...);`

**Example**

`INSERT INTO Employee_Info(EmployeeID, EmployeeName, Emergency ContactName, PhoneNumber, Address, City, Country)
VALUES ('06', 'Sanjana','Jagannath', '9921321141', 'Camel Street House No 12', 'Chennai', 'India');`
 
`INSERT INTO Employee_Info
VALUES ('07', 'Sayantini','Praveen', '9934567654', 'Nice Road 21', 'Pune', 'India');`

### UPDATE
This statement is used to modify the records already present in the table.

**Syntax**

`UPDATE TableName
SET Column1 = Value1, Column2 = Value2, ...
WHERE Condition;`

**Example**

`UPDATE Employee_Info
SET EmployeeName = 'Aahana', City= 'Ahmedabad'
WHERE EmployeeID = 1;`

### DELETE
This statement is used to delete the existing records in a table.

**Syntax**

`DELETE FROM TableName WHERE Condition;`

**Example**

`DELETE FROM Employee_Info
WHERE EmployeeName='Preeti';`

## Applied: Insert data into the students table

### Example:
`insert_query = """INSERT INTO stuffToPlot VALUES
                (1452549219,'2016-01-11 13:53:39','Python',6)"""`

In [26]:
for student in data:
    query = """
              INSERT INTO students (name, dob, siblings, birthplace, yearinnyc, favoritefood) 
              VALUES (?, ?, ?, ?, ?, ?)
              """
    print(student['name'])
    c.execute(query, (student['name'], 
                              student['DOB'], 
                              student['siblings'], 
                              student['Birthplace'], 
                              student['yearinnyc'], 
                              student['favoritefood']
                             )
                     )
conn.commit()

Amora Sun

OperationalError: table students has no column named favoritefood

## Select Statements

Select statements is the primary type of query you will write, as this is how we write q query to pull data back from a db


https://www.codecademy.com/articles/sql-commands

### SELECT
SELECT chooses the fields that you want displayed in your chart. This is the specific piece of information that you want to pull from your database.

**Syntax**

`SELECT first_name, last_name;`

Select * will pull back every column in the table

 ### FROM
FROM pinpoints the table that you want to pull the data from. 

**Syntax** 
`SELECT first_name, last_name
 FROM table;`

### WHERE
WHERE allows you to filter your query to be more specific. You  set up a conditional to filter your data

**syntax**

`SELECT first_name, last_name
FROM table
WHERE column = value`

### AND
AND allows you to add additional criteria to your WHERE statement. 


**Syntax**

`SELECT
     first_name, last_name
FROM
     table
WHERE
     column = value
AND
     column BETWEEN value AND value;`


### ORDER BY

Your ORDER BY clause will allow you to sort by any of the fields that you have specified in the SELECT statement. 

**Syntax**

`SELECT
     first_name, last_name
FROM
     table
WHERE
     column = value
AND
     column BETWEEN value AND value
ORDER BY
     column;`





### GROUP BY
"GROUP BY" is similar to the function in pandas where it will aggregate data that has similarities.

Here is your SQL query:

**Syntax**

`SELECT
     first_name, COUNT(last_name)
FROM
     table
WHERE
     column = value
AND
     column BETWEEN value AND value
GROUP BY
     column;`

### LIMIT
Depending on the amount of data you have in your database, it may take a long time to run the queries. It can be frustrating if you find yourself waiting a long time to run a query that you didn't really want to begin with. If you want to test our query, the LIMIT function is a great one to use because it allows you to limit the number of results you get.

**Syntax**

`SELECT
     first_name, COUNT(last_name)
FROM
     table
WHERE
     column = value
AND
     column BETWEEN value AND value
GROUP BY
     column
LIMIT
     100;`

## Applied: Write queries to answer the following questions:


### Questions
- Which student was born closest to the cohort's graduation date?
- Which student has the most siblings?
- How many students are only children?
- Which 3 students have lived in NYC the shortest amount of time?
- How many students are native New Yorkers?
- Do any two students have the same favorite food?